wayne-love/sn_esp32/src/main.cpp
  //switchADPublish("Blower","",mqttState,"{{ value_json.blower }}","blower",spaName, spaSerialNumber);
  //selectADPublish("Blower Mode", {"VariSpeed","Ramp"}, mqttState, "{{ value_json.blowermode }}", "blowermode", spaName, spaSerialNumber);

}

#pragma endregion

#pragma region MQTT Publish

void mqttPublishStatusString(String s){

  mqttClient.publish(String(mqttBase+"rfResponse").c_str(),s.c_str());

}

void mqttPublishStatus() {

  StaticJsonDocument<1024> json;

  json["watertemperature"] = String(sni.getWTMP() / 10) + "." + String(sni.getWTMP() % 10); //avoids stupid rounding errors
  json["heatertemperature"] = String(sni.getHeaterTemperature() / 10) + "." + String(sni.getHeaterTemperature() % 10); //avoids stupid rounding errors
  json["casetemperature"] = String(sni.getCaseTemperature()); //avoids stupid rounding errors
  json["voltage"]=String(sni.getMainsVoltage());
  json["current"]=String(sni.getMainsCurrent() / 10) + "." + String(sni.getMainsCurrent() % 10);
  json["power"]=String(sni.getPower() / 10) + "." + String(sni.getPower() % 10);
  json["heatingactive"]=sni.getRB_TP_Heater()? "ON": "OFF";
  json["ozoneactive"]=sni.getRB_TP_Ozone()? "ON": "OFF";
  json["totalenergy"]=String(sni.getPower_kWh() * 10); // convert to kWh to Wh.
  json["hpambtemp"]=String(sni.getHP_Ambient());
  json["hpcondtemp"]=String(sni.getHP_Condensor());
  json["temperaturesetpoint"]=String(sni.getSTMP() / 10) + "." + String(sni.getSTMP() % 10);
  json["heatermode"]=sni.HPMPStrings[sni.getHPMP()];

  json["pump1"]=sni.getRB_TP_Pump1()==0? "OFF" : "ON"; // we're ignoring auto here
  json["pump2"]=sni.getRB_TP_Pump2()==0? "OFF" : "ON"; // we're ignoring auto here
  json["pump3"]=sni.getRB_TP_Pump3()==0? "OFF" : "ON"; // we're ignoring auto here
  json["pump4"]=sni.getRB_TP_Pump4()==0? "OFF" : "ON"; // we're ignoring auto here
  json["pump5"]=sni.getRB_TP_Pump5()==0? "OFF" : "ON"; // we're ignoring auto here


  String y=String(year(sni.getSpaTime()));
  String m=String(month(sni.getSpaTime()));
  if (month(sni.getSpaTime())<10) m = "0"+m;
  String d=String(day(sni.getSpaTime()));
  if (day(sni.getSpaTime())<10) d = "0"+d;
  String h=String(hour(sni.getSpaTime()));
  if (hour(sni.getSpaTime())<10) h = "0"+h;
  String min=String(minute(sni.getSpaTime()));
  if (minute(sni.getSpaTime())<10) min = "0"+min;
  String s=String(second(sni.getSpaTime()));
  if (second(sni.getSpaTime())<10) s = "0"+s;

  json["datetime"]=y+"-"+m+"-"+d+" "+h+":"+min+":"+s;

// TODO : need to return blower vlaue

  json["auxheat"]=sni.getHELE()==0? "OFF" : "ON";

  json["status"]=sni.getStatus();

  String output = "";
  serializeJson(json,output);

  mqttClient.publish(mqttStatusTopic.c_str(),output.c_str());

}

#pragma endregion

void setup() {
  pinMode(TRIGGER_PIN, INPUT_PULLUP);

#if defined(ESP32)
  Serial.begin(115200);
  Serial.setDebugOutput(true);
#endif

  delay(200);

  WiFi.mode(WIFI_STA); 
  WiFi.begin();

  Debug.begin(WiFi.getHostname());
  Debug.setResetCmdEnabled(true);
  Debug.showProfiler(true);
#if defined(ESP32)
  Debug.setSerialEnabled(true);
#endif

  debugA("Starting...");

  debugI("Mounting FS");

  if (!LittleFS.begin()) {
    debugW("Failed to mount file system, formatting");
    LittleFS.format();
    LittleFS.begin();
  }

  debugI("Reading config file");
  File configFile = LittleFS.open("/config.json","r");
  if (configFile) {
    size_t size = configFile.size();
    // Allocate a buffer to store contents of the file.
    std::unique_ptr<char[]> buf(new char[size]);
    configFile.readBytes(buf.get(), size);

    DynamicJsonDocument json(1024);
    auto deserializeError = deserializeJson(json, buf.get());
    serializeJson(json, Serial);
    if ( ! deserializeError ) {
      debugI("Parsed JSON");
      mqttServer = json["mqtt_server"].as<String>();
      mqttPort = json["mqtt_port"].as<String>();
      mqttUserName = json["mqtt_username"].as<String>();
      mqttPassword = json["mqtt_password"].as<String>();
    } else {
      debugW("Failed to parse config file");
    }
    configFile.close();
  }


  if (mqttServer == "") { 
    mqttServer = "mqtt"; 
  }
  if (mqttPort == "") { 
    mqttPort = "1883"; 
  }

  mqttClient.setServer(mqttServer.c_str(),mqttPort.toInt());
  mqttClient.setCallback(mqttCallback);
  mqttClient.setBufferSize(2048);

  ui.begin();

}



void loop() {  



  checkButton();
  led.tick();
  mqttClient.loop();
  Debug.handle();

  if (ui.initialised) { 
    ui.server->handleClient(); 
  }

  if (WiFi.status() != WL_CONNECTED) {
    //wifi not connected
    led.setInterval(100);
    long now = millis();
    if (now-wifiLastConnect > 10000) {
      debugI("Wifi reconnecting...");
      wifiLastConnect = now;
      WiFi.reconnect();
    }
  } else {
    if (bootTime + 10000 < millis()) {

      sni.loop();

      if (sni.isInitialised()) {
        if ( spaSerialNumber=="" ) {
          debugI("Initialising...");
      
          spaSerialNumber = sni.getSerialNo1()+"-"+sni.getSerialNo2();
          debugI("Spa serial number is %s",spaSerialNumber.c_str());

          mqttBase = String("sn_esp32/") + spaSerialNumber + String("/");
          mqttStatusTopic = mqttBase + "status";
          mqttSet = mqttBase + "set";
          mqttAvailability = mqttBase+"available";
          debugI("MQTT base topic is %s",mqttBase.c_str());
        }
        if (!mqttClient.connected()) {  // MQTT broker reconnect if not connected
          long now=millis();
          if (now - mqttLastConnect > 1000) {
            led.setInterval(500);
            debugW("MQTT not connected, attempting connection to %s:%s",mqttServer.c_str(),mqttPort.c_str());
            mqttLastConnect = now;


            if (mqttClient.connect("sn_esp32", mqttUserName.c_str(), mqttPassword.c_str(), mqttAvailability.c_str(),2,true,"offline")) {
              debugI("MQTT connected");
    
              String subTopic = mqttBase+"set/#";
              debugI("Subscribing to topic %s", subTopic.c_str());
              mqttClient.subscribe(subTopic.c_str());

              mqttClient.publish(mqttAvailability.c_str(),"online",true);
              autoDiscoveryPublished = false;
            } else {
              debugW("MQTT connection failed");
            }

          }
        } else {
          if (!autoDiscoveryPublished) {  // This is the setup area, gets called once when communication with Spa and MQTT broker have been established.
            debugI("Publish autodiscovery information");
            mqttHaAutoDiscovery();
            autoDiscoveryPublished = true;
            sni.setUpdateCallback(mqttPublishStatus);
            mqttPublishStatus();

            sni.statusResponse.setCallback(mqttPublishStatusString);

          }
          led.setInterval(2000);
        }
      }
    }
  }
}